package com.lcy.chapter1.t_01_23;

/*
棋盘覆盖问题：给定一个大小为2^n 2^n个小方格的棋盘，其中有一个位置已经被填充，
现在要用一个L型（2*2个小方格组成的大方格中去掉其中一个小方格）形状去覆盖剩下的小方格。
求出覆盖方案，即哪些坐标下的小方格使用同一个L型格子覆盖。
注意：坐标从0开始。左上方的第一个格子坐标为(0,0)，第一行第二个坐标为(0,1)，
第二行第一个为(1,0)，以此类推。

Input

输入第一行为测试用例个数，后面每一个用例有两行，第一行为n值和特殊的格子的坐标（用空格隔开），
第二行为需要查找其属于同一个L型格子的格子坐标。


Output

输出每一行为一个用例的解，先按照行值从小到大、再按照列值从小到大的顺序输出每一个用例的两个坐标；
用逗号隔开。
 */

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

    }
}
